---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcExportElementType
source: html/b5372c03-5837-c6db-09e5-185d8fc31d1e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcExportElementType Property

"Export Type to IFC"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcExportElementType { get; }
```